//
// Created by Glucose_carbide on 25-8-8.
//

#ifndef DELAY_HPP
#define DELAY_HPP

// =============================== 调用库 ===============================
#include <cstdint>

// =============================== 宏定义区 ===============================

// =============================== 变量区 ===============================

// =============================== 函数声明 ===============================
void User_Delay_Init();
void Delay_us(uint16_t miu_seconds);
void Delay_ms(uint16_t milliseconds);

// =============================== 类声明 ===============================

#endif // DELAY_HPP
